cask_args appdir: "/Applications"

tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "heroku/brew"
tap "adoptopenjdk/openjdk"

brew "mas"
brew "autoconf"
brew "autojump"
brew "blueutil"
brew "libpng"
brew "freetype"
brew "sqlite"
brew "python"
brew "ddclient"
brew "elasticsearch"
brew "libogg"
brew "libevent"
brew "jpeg"
brew "libtiff"
brew "libvorbis"
brew "ffmpeg"
brew "gd"
brew "ghostscript"
brew "git"
brew "gsl"
brew "imagemagick@6", link: true
brew "libusb"
brew "libusb-compat"
brew "libgphoto2"
brew "libicns"
brew "libxml2"
brew "memcached"
brew "mosh"
brew "mysql"
brew "neovim"
brew "nmap"
brew "node@8"
brew "openssl"
brew "optipng"
brew "p7zip"
brew "pngcrush"
brew "postgresql"
brew "qt"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "ssh-copy-id"
brew "tmux"
brew "wget"
brew "yarn"
brew "heroku/brew/heroku"

cask "1password"
cask "appcleaner"
cask "backblaze"
cask "dash"
cask "docker"
cask "google-backup-and-sync"
cask "google-chrome"
cask "firefox"
cask "handbrake"
cask "iconjar"
cask "iterm2"
cask "openemu"
cask "sketch"
cask "skype"
cask "slack"
cask "spectacle"
cask "steam"
cask "sublime-text"
cask "transmit"
cask "vlc"
cask "zoomus"
cask "adoptopenjdk/openjdk/adoptopenjdk8-jre"

cask "font-open-sans"
cask "font-oswald"
cask "font-inconsolata"

mas "Microsoft Excel", id: 462058435
mas "Bear", id: 1091189122
mas "Things 3", id: 904280696
mas "Color Picker", id: 641027709
