cask_args appdir: "/Applications"

# tap "homebrew/core" # unnecessary? enabled by default?
tap "homebrew/bundle"
tap "heroku/brew"
tap "elastic/tap"
tap "mongodb/brew"
tap "gromgit/new-life"

brew "autoconf"
brew "autojump"
brew "bastet"
brew "blueutil"
brew "coreutils"
brew "ctags"
brew "curl"
brew "ddclient"
brew "diffutils"
brew "docker"
brew "duti"
brew "ffmpeg"
brew "findutils"
brew "freetype"
brew "gawk"
brew "gd"
brew "ghostscript"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "golang"
brew "grpcurl"
brew "gsl"
brew "heroku/brew/heroku"
brew "htop"
brew "icu4c"
brew "iproute2mac"
brew "jpeg"
brew "jq"
brew "libevent"
brew "libgphoto2"
brew "libicns"
brew "libogg"
brew "libpng"
brew "libtiff"
brew "libusb"
brew "libusb-compat"
brew "libvorbis"
brew "libxml2"
brew "libxslt"
brew "mas"
brew "memcached"
brew "mongodb-community@5.0"
brew "moreutils"
brew "mosh"
brew "mysql"
brew "neovim"
brew "nmap"
brew "node"
brew "nodenv"
brew "nsnake"
brew "openssl"
brew "optipng"
brew "p7zip"
brew "pngcrush"
brew "postgresql"
brew "pyenv"
brew "python"
brew "qrencode"
brew "qt"
brew "rbenv"
brew "rclone"
brew "redis"
brew "rsync"
brew "ruby-build"
brew "smartmontools"
brew "sqlite"
brew "ssh-copy-id"
brew "svn"
brew "thrift"
brew "tmux"
brew "vale"
brew "watchman"
brew "wget"
brew "wireguard-tools"
brew "yarn"
brew "youtube-dl"
brew "zork"

brew "gromgit/new-life/unrar"

cask "1password"
# cask "adoptopenjdk/openjdk/adoptopenjdk8-jre" seems broken?
cask "appcleaner"
cask "arq"
cask "backblaze"
cask "cyberduck"
cask "firefox"
cask "google-drive"
cask "google-chrome"
cask "handbrake"
cask "iterm2"
cask "logitech-options"
cask "meetingbar"
cask "minecraft"
cask "obsidian"
cask "openemu"
cask "rectangle"
cask "slack"
cask "steam"
cask "transmission"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

mas "Microsoft Excel", id: 462058435
mas "Things 3", id: 904280696
mas "Tailscale", id: 1475387142
mas "Xcode", id: 497799835