cask_args appdir: "/Applications"

tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "heroku/brew"
tap "adoptopenjdk/openjdk"
tap "elastic/tap"

brew "autoconf"
brew "autojump"
brew "awk"
brew "awscli"
brew "bastet"
brew "blueutil"
brew "coreutils"
brew "ctags"
brew "curl"
brew "ddclient"
brew "duti"
brew "elastic/tap/elasticsearch-full"
brew "ffmpeg"
brew "freetype"
brew "gd"
brew "ghostscript"
brew "git"
brew "gsl"
brew "heroku/brew/heroku"
brew "htop"
brew "icu4c"
brew "imagemagick@6", link: true
brew "iproute2mac"
brew "jpeg"
brew "jq"
brew "libevent"
brew "libgphoto2"
brew "libicns"
brew "libogg"
brew "libpng"
brew "libtiff"
brew "libu2f-host"
brew "libusb"
brew "libusb-compat"
brew "libvorbis"
brew "libxml2"
brew "libxslt"
brew "mas"
brew "memcached"
brew "mosh"
brew "mysql"
brew "neovim"
brew "ngrok"
brew "nmap"
brew "node"
brew "nodenv"
brew "nsnake"
brew "openssl"
brew "optipng"
brew "p7zip"
brew "pngcrush"
brew "postgis"
brew "postgresql"
brew "pyenv"
brew "python"
brew "qrencode"
brew "qt"
brew "rbenv"
brew "redis"
brew "rsync"
brew "ruby-build"
brew "smartmontools"
brew "sqlite"
brew "ssh-copy-id"
brew "svn"
brew "thrift"
brew "tmux"
brew "vale"
brew "watchman"
brew "wget"
brew "wireguard-tools"
brew "yarn"
brew "youtube-dl"
brew "zork"

cask "1password"
cask "adoptopenjdk/openjdk/adoptopenjdk8-jre"
cask "appcleaner"
cask "backblaze"
cask "dash"
cask "docker"
cask "firefox"
cask "font-inconsolata"
cask "font-open-sans"
cask "font-oswald"
cask "google-backup-and-sync"
cask "google-chrome"
cask "handbrake"
cask "iconjar"
cask "iterm2"
cask "logitech-options"
cask "meetingbar"
cask "openemu"
cask "rectangle"
cask "sketch"
cask "skype"
cask "slack"
cask "steam"
cask "sublime-text"
cask "transmit"
cask "vlc"
cask "zoomus"

mas "Bear", id: 1091189122
mas "Color Picker", id: 641027709
mas "Microsoft Excel", id: 462058435
mas "Patterns", id: 429449079
mas "SnippetsLab", id: 1006087419
mas "Things 3", id: 904280696
